## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:88" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:88" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:87fa79fb3e872404327a6e38fc375084140b361151d0cefd75df7c56986b1e0d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:e725bd21e36243f8da8368f3ad9e0cc22a2cae8ce983ca6fa995dac16cb9d4d0"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 88 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "0603923bf51900b3ccf4f930b3d340f0-6" -> "938984eea36f7f37854f599588f82097"
        id                     = "graphql.938984eea36f7f37854f599588f82097.zip"
        tags                   = {}
      ~ version_id             = "VkVRM6FyK41V4d2S6QqOPLsgP6JgIEd7" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "eqIo590my.9UpFxJw8U21evMuQpk5Vip" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.92ee0dcc5b6f8705cd5e9ea2ae27624a.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e92e42e2d30c45742de9661599f6706f-4" -> "dfc16f6dba238c463a17a9d1c5ab6e76"
      ~ id                     = "python.92ee0dcc5b6f8705cd5e9ea2ae27624a.zip" -> (known after apply)
      ~ key                    = "python.92ee0dcc5b6f8705cd5e9ea2ae27624a.zip" -> "python.dfc16f6dba238c463a17a9d1c5ab6e76.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "92ee0dcc5b6f8705cd5e9ea2ae27624a" -> "dfc16f6dba238c463a17a9d1c5ab6e76"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "yNaGOhWAWQnx.0euDN.8.UqfF3sDhH6q" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "59b9e236b9d2ced14983ab2037efe7c8" -> "1cf16508231f3d1824c9fd780b180ef5"
        id                     = "dist/200.html"
      ~ source_hash            = "59b9e236b9d2ced14983ab2037efe7c8" -> "1cf16508231f3d1824c9fd780b180ef5"
        tags                   = {}
      ~ version_id             = "QybIGRVLzdgG1avLddBNBJb70hqIZ7gj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6d7a98b3bc00d031dd667047bd2f9413" -> "5021ed02706427f2840d0ea85502a789"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "6d7a98b3bc00d031dd667047bd2f9413" -> "5021ed02706427f2840d0ea85502a789"
        tags                   = {}
      ~ version_id             = "TGw8SniGWOs2mOQQq4mwmo2HIlORha68" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "22d7b155f679016d8fd1ddbddb7eca09" -> "650645de52017afc0e22e76db7d760c4"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "22d7b155f679016d8fd1ddbddb7eca09" -> "650645de52017afc0e22e76db7d760c4"
        tags                   = {}
      ~ version_id             = "7zaC4z_.J2yiY8ow9.OtyqcO3ton4yNa" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "59b9e236b9d2ced14983ab2037efe7c8" -> "1cf16508231f3d1824c9fd780b180ef5"
        id                     = "dist/index.html"
      ~ source_hash            = "59b9e236b9d2ced14983ab2037efe7c8" -> "1cf16508231f3d1824c9fd780b180ef5"
        tags                   = {}
      ~ version_id             = "i2T0ZiQQBFAmAQIVldw.JXx9NqOENBeF" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.6fbde756.js"] will be destroyed
  # (because key ["static/js/app.6fbde756.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.6fbde756.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b34fe214df880385d39028a39a626474" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.6fbde756.js" -> null
-       key                    = "dist/static/js/app.6fbde756.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.6fbde756.js" -> null
-       source_hash            = "b34fe214df880385d39028a39a626474" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "1hFmzlgiN46x53HjIu9hIJwNy3jlT8W3" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.6fbde756.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.6fbde756.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.6fbde756.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.6fbde756.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.6fbde756.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.6fbde756.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "puyK3Kg6YV1PYV06NjCcATTN5IgUVZpy" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-11T19:53:55.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:55" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:55/invocations" -> (known after apply)
      ~ s3_key                         = "python.92ee0dcc5b6f8705cd5e9ea2ae27624a.zip" -> "python.dfc16f6dba238c463a17a9d1c5ab6e76.zip"
        tags                           = {}
      ~ version                        = "55" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
              ~ "DD_TAGS"                      = "git.commit.sha:10c088a3ac7772f41b3a72024234078531d4bee3,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6f872cf1609b67883f5e19c4e45c04aaa8fb71c8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "55" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:103" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:103/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "103" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
              ~ "DD_TAGS"                            = "git.commit.sha:10c088a3ac7772f41b3a72024234078531d4bee3,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6f872cf1609b67883f5e19c4e45c04aaa8fb71c8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "103" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:11/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
              ~ "DD_TAGS"                      = "git.commit.sha:10c088a3ac7772f41b3a72024234078531d4bee3,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:6f872cf1609b67883f5e19c4e45c04aaa8fb71c8,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "10c088a3ac7772f41b3a72024234078531d4bee3" -> "6f872cf1609b67883f5e19c4e45c04aaa8fb71c8"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "11" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @jakekreider, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8655240278)*